1. Create a Pandas Series from the list **[10, 20, 30, 40, 50]**. Print the Series, its index, and data type. Then create a DataFrame with columns **"Name", "Age", and "City"** containing at least 4 rows of data.

In [2]:
import pandas as pd

series = pd.Series([10, 20, 30, 40, 50])

print(series)

index = series.index
dtype = series.dtype

print(index,dtype)

dct = [{ "Name": "Jahirul Islam", "Age":23, "City": "Cumilla"},
       { "Name": "Mohammed", "Age":22, "City": "Chittagong"},
       { "Name": "Nabeel Ahmed", "Age":20, "City": "Dhaka"},
       { "Name": "Anamul Haque", "Age":23, "City": "Sylhet"}]
DataFrame = pd.DataFrame(dct)

print(DataFrame)

0    10
1    20
2    30
3    40
4    50
dtype: int64
RangeIndex(start=0, stop=5, step=1) int64
            Name  Age        City
0  Jahirul Islam   23     Cumilla
1       Mohammed   22  Chittagong
2   Nabeel Ahmed   20       Dhaka
3   Anamul Haque   23      Sylhet

2. Using any DataFrame, write code to print the number of rows and columns, column data types (**.dtypes**), and summary statistics (**.describe()**).

In [3]:
print("Size:",DataFrame.size)
print("Row:",DataFrame.shape[0])
print("Col:",DataFrame.shape[1])

print(DataFrame.dtypes)

DataFrame.describe(include="all")

Size: 12
Row: 4
Col: 3
Name    object
Age      int64
City    object
dtype: object

                 Name        Age     City
count               4   4.000000        4
unique              4        NaN        4
top     Jahirul Islam        NaN  Cumilla
freq                1        NaN        1
mean              NaN  22.000000      NaN
std               NaN   1.414214      NaN
min               NaN  20.000000      NaN
25%               NaN  21.500000      NaN
50%               NaN  22.500000      NaN
75%               NaN  23.000000      NaN
max               NaN  23.000000      NaN

3. Create a DataFrame using the dictionary below:

data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

Print **.columns, .index.** Access a single column and one full row.

In [4]:
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

df = pd.DataFrame(data)

print(df)

print(df.columns)
print(df.index)

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150
Index(['Product', 'Price', 'Quantity'], dtype='object')
RangeIndex(start=0, stop=4, step=1)

4. Using **.loc[]** and **.iloc[]**, show the first row, the second column, and a 2×2 block    from the middle of your DataFrame.

In [5]:
print(df.loc[0])
print(df.iloc[:,1])
# print(df.loc[:,"Price"])

print(df.iloc[1:3,1:3])
# print(df.loc[1:3,["Price","Quantity"]])

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object
0    10
1    50
2     5
3     7
Name: Price, dtype: int64
   Price  Quantity
1     50        60
2      5       200

5. Create a 4×3 DataFrame of student names and marks. Drop one column using **.drop()**, drop one row by index

In [6]:
data = {
    'Name': ['Aisha', 'Rahim', 'Karim', 'Sneha'],
    'Math': [85, 90, 78, 92],
    'Science': [88, 84, 80, 95]
}

df = pd.DataFrame(data)

print(df)

df.drop(columns="Science",inplace=True)
print(df)
df.drop(index=1,inplace=True)
print(df)

    Name  Math  Science
0  Aisha    85       88
1  Rahim    90       84
2  Karim    78       80
3  Sneha    92       95
    Name  Math
0  Aisha    85
1  Rahim    90
2  Karim    78
3  Sneha    92
    Name  Math
0  Aisha    85
2  Karim    78
3  Sneha    92

6. Create a DataFrame of employees with columns **"Name", "Department", and "Salary"**. Sort it by **"Salary"** in ascending order and by **"Name"** in descending order.

In [7]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing'],
    'Salary': [45000, 55000, 60000, 50000]
}

df = pd.DataFrame(data)

print(df,end="\n\n")

ascend = df.sort_values("Salary",ascending=True)
descend = df.sort_values("Name",ascending=False)
# sort = df.sort_values(["Name","Salary"],ascending=(0,1))

print(ascend,end="\n\n")
print(descend)
# print(sort)

      Name Department  Salary
0    Alice         HR   45000
1      Bob         IT   55000
2  Charlie    Finance   60000
3    Diana  Marketing   50000

      Name Department  Salary
0    Alice         HR   45000
3    Diana  Marketing   50000
1      Bob         IT   55000
2  Charlie    Finance   60000

      Name Department  Salary
3    Diana  Marketing   50000
2  Charlie    Finance   60000
1      Bob         IT   55000
0    Alice         HR   45000

7. Create a DataFrame of 8 students with columns **"Name"** and **"Score"**. Filter and print students with **Score > 60** and those with **Score < 40**.

In [16]:
data = {
    'Name': ['Aisha', 'Rahim', 'Karim', 'Sneha', 'Rafi', 'Tania', 'Nabil', 'Meena'],
    'Score': [35, 48, 62, 58, 56, 45, 11, 49]
}

df = pd.DataFrame(data)

print(df,end="\n\n")

df.loc[((df["Score"]<60) & (df["Score"]>40)),"Name"]

    Name  Score
0  Aisha     35
1  Rahim     48
2  Karim     62
3  Sneha     58
4   Rafi     56
5  Tania     45
6  Nabil     11
7  Meena     49

1    Rahim
3    Sneha
4     Rafi
5    Tania
7    Meena
Name: Name, dtype: object